backend/models/common/Account.php

SELECT * FROM `account` WHERE (`id`=2) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `account` WHERE (`username`='jorelanbo') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);